package com.company;

public class Tests {
    //Form http://statsoft.ru/home/textbook/modules/sttable.html#t
    private final double[][] testData = {
            {0, 0.40,     0.25,     0.10,     0.05,     0.025,    0.01,     0.005,    0.0005},
            {1, 0.324920, 1.000000, 3.077684, 6.313752, 12.70620, 31.82052, 63.65674, 636.6192},
            {2, 0.288675, 0.816497, 1.885618, 2.919986, 4.30265, 6.96456, 9.92484, 31.5991},
            {3, 0.276671, 0.764892, 1.637744, 2.353363, 3.18245, 4.54070, 5.84091, 12.9240},
            {4, 0.270722, 0.740697, 1.533206, 2.131847, 2.77645, 3.74695, 4.60409, 8.6103},
            {5, 0.267181, 0.726687, 1.475884, 2.015048, 2.57058, 3.36493, 4.03214, 6.8688},

            {6, 0.264835, 0.717558, 1.439756, 1.943180, 2.44691, 3.14267, 3.70743, 5.9588},
            {7, 0.263167, 0.711142, 1.414924, 1.894579, 2.36462, 2.99795, 3.49948, 5.4079},
            {8, 0.261921, 0.706387, 1.396815, 1.859548, 2.30600, 2.89646, 3.35539, 5.0413},
            {9, 0.260955, 0.702722, 1.383029, 1.833113, 2.26216, 2.82144, 3.24984, 4.7809},
            {10, 0.260185, 0.699812, 1.372184, 1.812461, 2.22814, 2.76377, 3.16927, 4.5869},

            {11, 0.259556, 0.697445, 1.363430, 1.795885, 2.20099, 2.71808, 3.10581, 4.4370},
            {12, 0.259033, 0.695483, 1.356217, 1.782288, 2.17881, 2.68100, 3.05454, 4.3178},
            {13, 0.258591, 0.693829, 1.350171, 1.770933, 2.16037, 2.65031, 3.01228, 4.2208},
            {14, 0.258213, 0.692417, 1.345030, 1.761310, 2.14479, 2.62449, 2.97684, 4.1405},
            {15, 0.257885, 0.691197, 1.340606, 1.753050, 2.13145, 2.60248, 2.94671, 4.0728}
    };

    public double[][] getTestData() {
        return testData;
    }
    public double [] getTestDF(){
        return testData[0];
    }
    public double getDF(double x, int n) throws RuntimeException {
        if(n<1 || n>15){
            throw new RuntimeException("N должно находиться в диапазоне 1..15");
        }
        for (int i = 1; i < testData[n].length; i++){
            if(testData[n][i] == x){
                return  testData[0][i];
            }
        }

        throw new RuntimeException("Тестовое значение не может быть найдено!");
    }

    public double getVal(double alpha, int n) throws RuntimeException {
        if(n<1 || n>15){
            throw new RuntimeException("N должно находиться в диапазоне 1..15");
        }
        for (int i = 1; i < testData[n].length; i++){
            if(testData[0][i] == alpha){
                return testData[n][i];
            }
        }

        throw new RuntimeException("Тестовое значение не может быть найдено!");
    }

}
